Merge pull request #5 from Alston16/feature/benchmark-jobs
Add benchmark jobs
